<details ><summary>apply for portal 2025-03-06 04:15:24 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.portal[0] will be updated in-place
  ~ resource "cloudns_dns_record" "portal" {
        id    = "584211377"
      ~ value = "104.243.35.45" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.portal_wildcard[0] will be updated in-place
  ~ resource "cloudns_dns_record" "portal_wildcard" {
        id    = "584211386"
        name  = "*"
      ~ value = "104.243.35.45" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.renterd_bus will be updated in-place
  ~ resource "cloudns_dns_record" "renterd_bus" {
        id    = "583933100"
        name  = "bus.lumeportal-portal-renterd-cluster.node"
      ~ value = "o985epqp2l8or8ijmmpbadvr9k.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.portal[0].module.portal_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.redis.module.valkey_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 4 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  ~ mysql_endpoint       = "provider.ny-01.node.infra.lumeweb.com:32303" -> (known after apply)
module.mysql.module.mysql_deployment.akash_deployment.service: Creating...
module.redis.module.valkey_deployment.akash_deployment.service: Creating...
module.redis.module.valkey_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.redis.module.valkey_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Creation complete after 30s [id=20514955:1:1:akash1vkzrwnzdfgguspdju4729t7g8k3yvd5nn6hs69:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Creating...
module.redis.module.valkey_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.redis.module.valkey_deployment.akash_deployment.service: Creation complete after 35s [id=20514957:1:1:akash1vkzrwnzdfgguspdju4729t7g8k3yvd5nn6hs69:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Creation complete after 30s [id=20514960:1:1:akash1vkzrwnzdfgguspdju4729t7g8k3yvd5nn6hs69:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.renterd_bus: Modifying... [id=583933100]
module.portal[0].module.portal_deployment.akash_deployment.service: Creating...
cloudns_dns_record.renterd_bus: Modifications complete after 0s [id=583933100]
module.portal[0].module.portal_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.portal[0].module.portal_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.portal[0].module.portal_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.portal[0].module.portal_deployment.akash_deployment.service: Creation complete after 30s [id=20514965:1:1:akash1vkzrwnzdfgguspdju4729t7g8k3yvd5nn6hs69:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]

Apply complete! Resources: 4 added, 1 changed, 0 destroyed.

Outputs:

mysql_endpoint = "provider.ny-01.node.infra.lumeweb.com:30510"
renterd_bus_endpoint = "bus.lumeportal-portal-renterd-cluster.node.lumeportal.com"

```
</details>
</details>